{"data":{"markdownRemark":{"html":"<p>I'm currently contracted to create a web service using some data from a third party Angular application. I worked off a proof of concept codebase that used Chrome's new <a href=\"https://github.com/GoogleChrome/puppeteer\">Puppeteer</a> API to scrape this site. I strongly regret not starting from scratch.</p>\n<!-- more -->\n<h2>What is Puppeteer?</h2>\n<p>Puppeteer is a Node API that allows you to control Google's headless Chrome browser. Imagine a version of your browser that can send and receive requests but has no GUI. It works in the background, performing actions as instructed by an API. This makes Puppeteer great for end to end testing a web application. You can truly simulate the user experience, typing where they type and clicking where they click. Another use case for Puppeteer is web scraping a single page web application. Let's explore how this might work.</p>\n<h2>A Simple Example</h2>\n<p>For any Puppeteer project, the first task is to create an instance of the headless browser.</p>\n<pre><code class=\"language-js\">const browser = await puppeteer.launch()\n\n// We will use this page instance and it's API frequently\nconst page = await this.browser.newPage();\n</code></pre>\n<p>After that's done, it's trivial to navigate to and begin interacting with a webpage. Let's suppose I want to fill out a login form and submit an authentication request to a website. In an ideal situation, it looks like this.</p>\n<pre><code class=\"language-js\">// Navigate to the website\nawait page.goto(\"https://website/login\");\n\n// Provide the selector of an input box and the content to type\nawait page.type(\"input#username\", CREDENTIALS.username);\nawait page.type(\"input#password\", CREDENTIALS.password);\nawait page.click(\"button#login\"); // Click the login button\n\n// Wait until the screen changes and a node matching\n// the selector #logged-in-successfully appears,\n// at which point we know the login was successful\nawait page.waitForSelector(\"#logged-in-successfully\");\n</code></pre>\n<p>We just successfully filled out a form, submitted an HTTP request containing our form data, and waited for the page to change upon successful login. This is where Puppeteer shines. Let's look at a more complicated example.</p>\n<h2>A More Complicated Example</h2>\n<p>Today's web uses a mix of simple html driven forms as well as more complicated, javascript-driven forms, rich with functionality like autocomplete and dynamic dropdown menus. I'm sure you've used a calendar date picker. These components each need to be treated differently.</p>\n<p>Here is a modified version of some code I wrote for my client:</p>\n<pre><code class=\"language-js\">// The form inputs I want to fill out\n// and their corresponding selectors\nconst fields = {\n  type: 'input[ng-model=\"type\"]',\n  origin: 'input[ng-model=\"origin\"]',\n  destination: 'input[ng-model=\"destination\"]',\n  date: 'input[ng-model=\"date\"]'\n};\n\nfunction search(searchParams) {\n  const page = await this.browser.newPage();\n  await page.goto(\"https://website/search\");\n\n  // We need to click a button to make the search form\n  // appear, but first make sure that button has rendered\n  await page.waitForSelector(\".new-search\");\n  await page.click(\".new-search\");\n\n  // Fill out the form\n  for (const field of Object.keys(fields)) {\n    if (searchParams[field]) {\n      const selector = fields[field];\n\n      // We want to make sure each DOM node is rendered\n      // before we try to do anything to it.\n      await page.waitForSelector(selector);\n\n      // Some inputs need to be focused first for page.type to work\n      // Might as well focus on all of them\n      await page.focus(selector);\n\n      // Some inputs have defaults that need to be\n      // erased before typing your own input\n      if (field === \"date\" || field === \"type\") {\n        // This is a helper function I wrote\n        await deleteInput(page, selector);\n      }\n\n      await page.type(selector, searchParams[field]);\n\n      // This field won't register the typed data\n      // until Enter is pressed.\n      // This is because the 'type' field is a dropdown\n      // where one of a specific set of inputs must be clicked.\n      if (field === \"type\") {\n        await page.keyboard.press(\"Enter\");\n      }\n    }\n  }\n}\n</code></pre>\n<p>The first thing to notice is that the code is messy and full of weird exceptions. To make matters worse, it doesn't always work.</p>\n<h2>Brace Yourself for Flaky Behavior</h2>\n<p>Working with Puppeteer was an exercise in guesswork. Given the same inputs, Puppeteer did not always produce the same outputs<sup><a href=\"#footnote1\">1</a></sup>. This flaky behavior made the project unnecessarily challenging and required me to do additional engineering to increase reliability, which was frustrating considering the alternative.</p>\n<h2>Puppeteer Was Completely Unnecessary</h2>\n<p>Puppeteer has a API that allows you to execute arbitrary code against the DOM. After scraping form results with this API and getting the same flaky behavior described above, I ditched the approach and started grabbing data from the HTTP response objects themselves. Below is a primitive version of some code I wrote to do this.</p>\n<pre><code class=\"language-js\">waitForUrl(page, urlPrefix) {\n  return new Promise(resolve => {\n    page.on(\"response\", res => {\n      if (!res.url.startsWith(urlPrefix)) {\n        return;\n      }\n      resolve(res.json());\n    };\n  });\n}\n</code></pre>\n<p>The page passed into this function is the same page object created above by the Puppeteer API. Among other things, it is an event emitter that allows me to listen for any HTTP responses. I've essentially created a promise that resolves to the response body of a particular ajax request. This allowed me interact with the server API directly and removed the DOM from the data retrieval process, greatly reducing the chance for flaky behavior. But that begs the question, why use Puppeteer at all? Why not simply send http requests to the server API manually and ditch the complicated form submission code above That's how I should have started all along.</p>\n<h2>When is Puppeteer the Right Solution</h2>\n<p>I can only think of a single scenario where using Puppeteer for scraping is superior to the alternative: if the information you want is generated using a combination of API data and javascript code. After all, you would have no other way to simulate the javascript code without rewriting it.</p>\n<p>If, however, all you need is data from the server, go the simple route and hit the API with an HTTP library like <a href=\"https://github.com/axios/axios\">axios</a> or <a href=\"https://github.com/request/request\">request</a>. If you are scraping a server side rendered application, you can combine one of the aforementioned tools with <a href=\"https://github.com/cheeriojs/cheerio\">Cheerio</a>, giving you a far more user friendly DOM manipulation API than that offered my Puppeteer.</p>\n<p><em>If you need help with webscraping or puppeteer, I do <a href=\"/hire-me\">consulting</a> work and am currently looking for new clients. Please contact me for more details.</em></p>\n<h4>Footnotes</h4>\n<p><a name=\"footnote1\">1</a>: You might be curious why Puppeteer exhibited flaky behavior. One issue that I ran into was animations. I might attempt to click a DOM node, but if the animation had not finished, the click would not register. In essence, it would appear as if the click had worked, but once the animation finished, the DOM would reset itself, undoing my click. I think this is simply how Angular's digest loop reacted to a click at an unexpected time. Unfortunately, Puppeteer provides no functionality to determine when an animation has finished (after all, how would it!). I tried a couple solutions. One entailed a sleep function to wait a couple hundred milliseconds for the animation to finish, but it simply exacerbated the flaky behavior. A second involved executing the click only once the DOM node had a particular class that indicated the animation had finished. At one point, I even tried to disable all animations across the website. All these solutions were half-baked.</p>","frontmatter":{"title":"Scraping the Web with Puppeteer: Lessons Learned","date":"2017-12-09T15:35:13.000Z"}}},"pageContext":{"slug":"scraping-the-web-with-puppeteer-lessons-learned"}}