{"data":{"allMarkdownRemark":{"edges":[{"node":{"html":"<p>If you've made your way here, I assume your looking to build yourself a blog or a static website. I also assume that you're a developer and want the flexibility the customize your site. If you're instead looking for an out-of-the-box solution, I suggest you look at a blogging platform like <a href=\"https://medium.com/\">Medium</a> or, if you want a little more customizability, perhaps <a href=\"https://wordpress.com/\">Wordpress</a></p>\n<p>There are two major static site generators in the Javascript ecosystem: the incumbent <a href=\"https://hexo.io\">Hexo</a> and the up-and-coming <a href=\"https://www.gatsbyjs.org/\">GatsbyJS</a>. In case you're just here for a TL;DR, GatsbyJS is the far better option. This site was originally built with Hexo, but I've recently felt compelled to switch. Let's talk about why.</p>\n<!-- more -->\n<h2>Different Products</h2>\n<p>First and foremost, I want to elaborate on what Hexo and Gatsby are designed to do. Both are static site generators, but at their hearts, at their hearts, they are very different products: Hexo is a blog generator; Gatsby sophisticated static content creation platform.</p>\n<h3>Hexo</h3>\n<p>Hexo specializes in creating markdown file driven blogging websites (with maybe a handful of non-blog pages). This specialization comes with tradeoffs. It's very easy to get a blog up and running, but if you want to do anything more sophisticated, it will range from challenging to impossible. This is fine for most people's use cases, however.</p>\n<h3>Gatsby</h3>\n<p>Gatsby epitomizes customizability and allows for the creation of arbitrary static sites, ranging from a simple blog to a fully featured e-commerce websites. It provides <a href=\"https://www.gatsbyjs.org/docs/node-apis/\">an API</a> for you to build a custom GraphQL API composed of data from a variety of resources, and then it affords you the flexibility to query that API however you like to dynamically compose your static website based on its data. There's obviously tradeoffs here as well. You might be given a lot of power, but that also requires learning some new tools. Let's get into the nitty gritty details.</p>\n<h2>Getting Up and Running</h2>\n<p>Both platforms are fairly easy to get from <code class=\"language-text\">yarn install</code> to writing blog articles, though Hexo definitely wins in this category.</p>\n<h3>Hexo</h3>\n<p>With Hexo, I was able to install the application, run a couple [configuration commands](<a href=\"https://hexo.io/docs/setup\">https://hexo.io/docs/setup</a>, pick a <a href=\"https://hexo.io/themes/index.html\">theme from their website</a>, and get writing.</p>\n<h3>Gatsby</h3>\n<p>Gatsby was not exactly hard to setup, but the sheer volume of documentation on their website made the process a tad more challenging. There are two places you can start: their <a href=\"https://www.gatsbyjs.org/docs/\">getting started page</a> or <a href=\"https://www.gatsbyjs.org/tutorial/\">their tutorial</a>. The former will help you get a server up and running and will link you to the <a href=\"https://www.gatsbyjs.org/starters/?v=2\">starter library</a> where you can choose from many potential themes. The latter will teach you how to customize your website; this is where Gatsby really shines.</p>\n<h2>Developer Experience</h2>\n<p>The rest of this article is going to discuss various facets of the developer experience modifying a site built with Hexo/Gatsby.</p>\n<h2>Developer Tooling</h2>\n<p>What does the process of modifying code look like? What tooling is provided out of the box?</p>\n<h3>Hexo</h3>\n<p>When I began with Hexo, I picked a theme called Concise, and my experienced mostly stem from customizing this theme, though in my journey's, I delved quite deeply into Hexo source code (which should be telling) and into the plugin ecosystem.</p>\n<p>My theme happened to be written using quite dated technology. My primary complaint is that it’s templating language is <a href=\"https://ejs.co/\">EJS</a>, which was an absolute nightmare to read. Here is some sample code from Concise.</p>\n<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/f97f98761f9e68564060ccfd117dae13/e5894/concise-code.png\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 680px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 30.626780626780626%; position: relative; bottom: 0; left: 0; background-image: url('data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAAGCAYAAADDl76dAAAACXBIWXMAAAsSAAALEgHS3X78AAAA6klEQVQY052QwVLEIBBE9/+/Uje7iQkJLIQAgSXPIepBq/RgV/UUHKZ59CXEiNcaM89cu477/YZSM/sa0NqRlgWeT4q4iqmV33QcB5c2inP0146X1zvdtWfoNf3NYIY34jhi+kEeuzHKPT0sDWLfd/ZcCSlTcz7Dmi5tPEPAqwUzeZxJPB4bs7HilS1EIdU4azHG4FbPpBROgu1WmBZHWd33wOI3YkrU6Bs4/9XHl9shBqLPQlHEEaUtw6RRixWijSyVHNJdW/jLJ2EVsm1e8MOEHTWr0nghXn2UrhI5l7Mj2tInxRfNz7Cmd/s30vXaFhfWAAAAAElFTkSuQmCC'); background-size: cover; display: block;\"\n    >\n      <picture>\n        <source\n          srcset=\"/static/f97f98761f9e68564060ccfd117dae13/4ca7d/concise-code.webp 170w,\n/static/f97f98761f9e68564060ccfd117dae13/515c8/concise-code.webp 340w,\n/static/f97f98761f9e68564060ccfd117dae13/d6460/concise-code.webp 680w,\n/static/f97f98761f9e68564060ccfd117dae13/0b31f/concise-code.webp 702w\"\n          sizes=\"(max-width: 680px) 100vw, 680px\"\n          type=\"image/webp\"\n        />\n        <source\n          srcset=\"/static/f97f98761f9e68564060ccfd117dae13/f4d37/concise-code.png 170w,\n/static/f97f98761f9e68564060ccfd117dae13/dee79/concise-code.png 340w,\n/static/f97f98761f9e68564060ccfd117dae13/7ef4c/concise-code.png 680w,\n/static/f97f98761f9e68564060ccfd117dae13/e5894/concise-code.png 702w\"\n          sizes=\"(max-width: 680px) 100vw, 680px\"\n          type=\"image/png\"\n        />\n        <img\n          class=\"gatsby-resp-image-image\"\n          style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n          src=\"/static/f97f98761f9e68564060ccfd117dae13/7ef4c/concise-code.png\"\n          alt=\"Code sample from Concise\"\n          title=\"\"\n          src=\"/static/f97f98761f9e68564060ccfd117dae13/7ef4c/concise-code.png\"\n        />\n      </picture>\n      </span>\n  </span>\n  \n  </a>\n    </p>\n<p>Apart from being unreadable (and certainly hard to edit), this syntax is at odds with application discoverability. It makes trivial exercises like console logging prone to error. Furthermore, the syntax is completely incompatible to the modern formatting tool, <a href=\"https://prettier.io/\">prettier</a>.</p>\n<p>Hexo does allow for other templating languages, but it's lack of standardization (and age) allowed for the use of EJS in the first place.</p>\n<h3>Gatsby</h3>\n<p>Gatsby shines as far as developer tooling goes. All Gatsby applications are built using a modern tool chain including <a href=\"https://reactjs.org/\">React</a> and <a href=\"https://graphql.org/\">GraphQL</a>. Both are a pleasure to work with and were immediate productivity boosters for me.</p>\n<p>Both of these tools do have a non-trivial learning curve, though the Gatsby docs do a decent job assuming you know nothing about how they work. And realistically, you don't need to understand either well to achieve productivity, since ultimately most of your code will be Javascript.</p>\n<p>There is also a non-trivial investment required in understanding the aforementioned <a href=\"https://www.gatsbyjs.org/docs/node-apis/\">Gatsby API</a>. It's incredibly powerful but also not immediately obvious how to use. I was able to supplement the documentation with blogs/tutorials such that the learning requiremnts were manageable.</p>\n<p>Gatsby also comes with numerous developer tools preconfigured to optimize your productivity. For example, a <a href=\"https://github.com/graphql/graphiql\">GraphiQL</a> (more on this later) is there to allow you to explore the data models of your various data sources, prettier is automatically configured ensuring that your code remains consistently formatted, code is automatically hot reloaded, and <a href=\"https://eslint.org/\">ESlint</a> is configured to catch your mistakes.</p>\n<p>Behind the scenes, Gatsby configures webpack for you, ensuring that some of the most challenging parts of the React ecosystem are abstracted away. It goes to extra mile and make things like service workers, inlining critical CSS, and CSS modules are automatic or a plugin away. Here is a more extensive list of its <a href=\"https://www.gatsbyjs.org/features/\">features</a>.</p>\n<p>Gatsby easily wins this competition.</p>\n<h2>Documentation</h2>\n<h2>Hexo</h2>\n<p>Hexo does a great job of ensuring you need to read as little text as possible in order to get a blog up and running. Once you want to start customizing your blog, however, the documentation's previously appreciated brevity shows it's warts.</p>\n<p>Many key topics are ambiguously referenced but never expounded upon. I remember agonizing over providing support for both pagination and article excerpts. <a href=\"https://hexo.io/docs/variables\">This page</a> seems to hint that the next and previous blog posts are available from their API, though the fields were always <code class=\"language-text\">undefined</code>. I never figured out why.</p>\n<p>Other times it's the disorganization that hurts so bad. It's not uncommon to be looking at the right thing and not know what you're looking at. If you want to customize your theme, chances are this page will be your best friend (<a href=\"https://hexo.io/docs/variables.html\">https://hexo.io/docs/variables.html</a>). Unfortunately, the page makes absolutely no indication as its purpose. For the record, it documents the variable names that are injected into your template engine's rendering system.</p>\n<h2>Gatsby</h2>\n<p>Gatsby's documentation is thoughtful, well-organized, and remarkably detailed. It has everything from tutorials to top deep dives. It even has pages explaining and justifying its architectural decision. And to top all this off, it has a <a href=\"https://www.gatsbyjs.org/docs/gatsby-style-guide/\">style guide</a> to ensure readability. With all this said, there are still placeholder pages (<a href=\"https://www.gatsbyjs.org/docs/dropping-images-into-static-folders/\">like this one</a>), though I never found myself unable to answer a question about their system.</p>\n<h2>Community</h2>\n<p>How easy it to solve issues using tutorials and stack overflow? Are small issues blocking or not? What is the plugin ecosystem like?</p>\n<h2>Plugin Ecosystem</h2>\n<h3>Hexo</h3>\n<h3>Gatsby</h3>\n<p>Gatsby is infinitly more discoverable</p>\n<p>If you are choosing to host your own blog, chances are you are doing it because it want the flexibility to customize your website. Otherwise there are countless managed services you can used, like Wordpress.</p>\n<p>Challenges with Hexo</p>\n<p>When I began with Hexo, I picked a theme called Concise, modified the configuration slightly, and was able to get my site up and live quite simply. The challenges arose when I started trying to make tweaks to my website.</p>\n<p>First and foremost, the Hexo documentation pales in comparison to that in Gatsby. There is just absolutely no comparison between the two.</p>\n<p>If you want to right a basic plugin, the obvious syntax of module.exporting your function will not work. The plugin page <a href=\"https://hexo.io/docs/plugins\">https://hexo.io/docs/plugins</a> provides absolutely no guidance as to how to get your code working. Rather, you need to intuit that Hexo is <code class=\"language-text\">eval</code>ing your code and injecting global variables in the process. You need to use something like <code class=\"language-text\">hero.register</code>. Huh. How was I supposed to know that. The documentation sure doesn’t say</p>\n<p>Even the documentation for plugin based system is bad. If you want to incorporate excerpts into your blog, you need to know the that a &#x3C;!— more —> blog needs to be inserted in your post’s markdown file. The content before this comment delineates the bounds of an excerpt. You would only know this if you happened to read this Github issue <a href=\"https://github.com/hexojs/hexo/issues/1143\">https://github.com/hexojs/hexo/issues/1143</a></p>\n<p>I never was able to get pagination working, despite my best efforts.</p>\n<p>Hero completely breaks my dev setup (listing, prettier) with EJS</p>\n<p>Gatsby</p>\n<p>Gatsby provides a completely different experience than Hexo. Similar to Hexo, it has a small core that many many plugins are built on top of. Unlike Hexo, howver, the plugins are documented and they work.</p>\n<p>Coming from a GraphQL and React background, the transition has been pretty seamless. If you want to create new pages dynamically (a must if you are creating a blog), then you will need to interect with the <a href=\"https://www.gatsbyjs.org/docs/node-apis/#createPages\">Gatsby Node API</a>. This is definitely more complicated than anything I ever had to do with Hexo. With that said, there are pre-built themes to pick from as well, and after the learning phase, you as a developer are completely empowered. I never felt that way with Hexo.</p>\n<p>Simple things are far more complicated. Adding static pages is simple. Rendering them from markdown is quite a bit of work. Hexo is far more opinionated in this regard and makes such options simple.</p>\n<p>.\nLinting built-in to ensure you don’t make mistakes and to protect against security vulnerabilities. Like this one: 49:11 warning Using target=\"_blank\" without rel=\"noopener noreferrer\" is a security risk: see <a href=\"https://mathiasbynens.github.io/rel-noopener\">https://mathiasbynens.github.io/rel-noopener</a> react/jsx-no-target-blank</p>\n<p>Some simple things are hard - figuring out how to add an image to markdown was challenging. Far easier, however, than issues in Hexo. Plenty of Github comments to read</p>\n<p>Gatsby requires javascript. I didn’t realize until I was nearly done that the built site would use JS. This makes the site slightly less accessible</p>","slug":"hexo-vs-gatsbyjs-comparing-nodejs-static-site-generators","frontmatter":{"title":"GatsbyJS Vs. Hexo Comparing Node.js Static Site Generators","date":"2018-11-18T00:00:00.000Z"}}}]}},"pageContext":{"category":"Node.js Ecosystem"}}