{"data":{"allMarkdownRemark":{"totalCount":14,"edges":[{"node":{"fields":{"slug":"leveraging-immutability-in-react"},"excerpt":"<p>React has taken the web development community by a storm, and with it functional programming concepts have embedded themselves in the mainstream. One common statement you will often read is that all state in React should be immutable, and this practice is justified as necessary for performance reasons. This statement is entirely true, but it only tells half the truth. Immutability alone will not yield any performance gains in React (it'll actually make things slower).</p>\n","fileAbsolutePath":"/Users/nickdrane/projects/blog/content/_posts/leveraging-immutability-in-react.md","frontmatter":{"title":"Leveraging Immutability in React","date":"2017-09-27T09:30:27.000Z"}}},{"node":{"fields":{"slug":"hidden-costs-of-postgresql-jsonb"},"excerpt":"<p><a href=\"https://www.postgresql.org/\">Postgres</a> introduced the <a href=\"https://www.postgresql.org/docs/current/static/datatype-json.html\">JSONB</a> type in version 9.4 with considerable excitement. JSONB promised to marry a favorite relational database with the noSQL world, permitting data to be stored in the database as JSON without the need for re-parsing whenever a field is accessed. Moreover, the binary storage format permits indexing and complex queries against the stored JSON blobs. This data format embodies the flexible schema and was readily adopted at <a href=\"https://fraight.ai/\">Fraight</a>.</p>\n","fileAbsolutePath":"/Users/nickdrane/projects/blog/content/_posts/hidden-costs-of-postgresql-jsonb.md","frontmatter":{"title":"The Hidden Costs of PostgreSQL's JSONB Datatype","date":"2018-09-30T00:00:00.000Z"}}},{"node":{"fields":{"slug":"build-your-own-nested-query-string-encoder"},"excerpt":"<p>The other day at work, one of my colleagues was frated that he was unable to encode nested objects in a query string and still maintain a readable URL. I went home that night and coded up a simple solution to this problem, and I thought I'd share it here today. This <a href=\"https://github.com/nadrane/querystring-encoder\">Github repo</a> contains specs and the solution code.</p>\n","fileAbsolutePath":"/Users/nickdrane/projects/blog/content/_posts/build-your-own-nested-query-string-encoder.md","frontmatter":{"title":"Build Your Own Nested Query String Encoder/Decoder","date":"2018-04-13T15:17:00.000Z"}}},{"node":{"fields":{"slug":"build-your-own-regex"},"excerpt":"<p>I stumbled upon an <a href=\"https://www.cs.princeton.edu/courses/archive/spr09/cos333/beautiful.html\">article</a> the other day where Rob Pike implements a rudimentary regular expression engine in c. I converted his code to Javascript and added test specs so that someone can self-guide themselves through the creation of the regex engine. The specs and solution can be found in this <a href=\"https://github.com/nadrane/build-your-own-regex\">GitHub repository</a>. This blog post walks through my solution.</p>\n","fileAbsolutePath":"/Users/nickdrane/projects/blog/content/_posts/build-your-own-regex.md","frontmatter":{"title":"Build a Regex Engine in Less than 40 Lines of Code","date":"2017-11-28T00:00:00.000Z"}}},{"node":{"fields":{"slug":"scraping-the-web-with-puppeteer-lessons-learned"},"excerpt":"<p>I'm currently contracted to create a web service using some data from a third party Angular application. I worked off a proof of concept codebase that used Chrome's new <a href=\"https://github.com/GoogleChrome/puppeteer\">Puppeteer</a> API to scrape this site. I strongly regret not starting from scratch.</p>\n","fileAbsolutePath":"/Users/nickdrane/projects/blog/content/_posts/scraping-the-web-with-puppeteer-lessons-learned.md","frontmatter":{"title":"Scraping the Web with Puppeteer: Lessons Learned","date":"2017-12-09T15:35:13.000Z"}}},{"node":{"fields":{"slug":"using-jq-to-effortlessly-ingest-newline-delimited-JSON-into-postgres"},"excerpt":"<p>I recently wanted to ingest a <a href=\"https://en.wikipedia.org/wiki/JSON_streaming#Line-delimited_JSON\">line-delimited</a> JSON file into <a href=\"https://www.postgresql.org/\">Postgres</a> for some quick data exploration. I was surprised when I couldn't find a simple CLI solution that parsed the JSON and loaded each field into its own column. Every approach I found instead inserted the entire JSON object in a JSONB field. Here is my solution.</p>\n","fileAbsolutePath":"/Users/nickdrane/projects/blog/content/_posts/using-jq-to-effortlessly-ingest-newline-delimited-JSON-into-postgres.md","frontmatter":{"title":"Using Shell Commands to Effortlessly Ingest Line-Delimited JSON into PostgreSQL","date":"2018-10-18T00:00:00.000Z"}}},{"node":{"fields":{"slug":"regex-and-automated-test-fuzzing"},"excerpt":"<p>I posted my article <a href=\"https://nickdrane.com/build-your-own-regex/\">Build Your Own Regex Engine</a> on Reddit the other day, and one of the commenters claimed that the implementation should be trivial to break. Since I had already tested my program against a customized suite of tests, the remark got me thinking about how I could further increase my confidence in the correctness of my program. One extremely low cost however effective strategy for identifying faults in software is known as fuzzing.</p>\n","fileAbsolutePath":"/Users/nickdrane/projects/blog/content/_posts/regex-and-automated-test-fuzzing.md","frontmatter":{"title":"Regex And Automated Test Fuzzing","date":"2017-12-06T00:00:00.000Z"}}},{"node":{"fields":{"slug":"a-performance-guide-to-gatsbyjs"},"excerpt":"<p>In my article <a href=\"/hexo-vs-gatsbyjs-comparing-nodejs-static-site-generators\">comparing Gatsby to Hexo</a>, I talked about my experience switching writing this blog using <a href=\"https://hexo.io/\">Hexo</a> and then later using <a href=\"https://www.gatsbyjs.org/\">Gatsby</a>. In the process, the size of my initial page ballooned 5x.</p>\n<p>In retrospect, I did not fully understand the abstraction that Gatsby provides. Fortunately, if you follow a simple rule of thumb, you can avoid bloating your network requests and maintain an ultra-performant website.</p>\n","fileAbsolutePath":"/Users/nickdrane/projects/blog/content/_posts/a-performance-guide-to-gatsbyjs/a-performance-guide-to-gatsbyjs.md","frontmatter":{"title":"One Simple Performance Tip to Optimize GatsbyJS Static Sites","date":"2018-12-13T00:00:00.000Z"}}},{"node":{"fields":{"slug":"using-reduce"},"excerpt":"<p>My first introduction to functional programming was a couple years ago when I read through the famous <a href=\"https://mitpress.mit.edu/sicp/full-text/book/book.html\">SICP</a>. As someone who had up to this point worked with mostly in object oriented and imperative languages, I had rarely seen <code class=\"language-text\">map</code>, <code class=\"language-text\">fitler</code>, and <code class=\"language-text\">reduce</code> before that time. The purpose of the former two felt obvious; the latter one not so much. This blog post is geared for someone who knows how <code class=\"language-text\">reduce</code> works but feels like they struggle to use it practically.</p>\n","fileAbsolutePath":"/Users/nickdrane/projects/blog/content/_posts/using-reduce.md","frontmatter":{"title":"Using Reduce","date":"2017-09-28T10:36:30.000Z"}}},{"node":{"fields":{"slug":"you're-hiring-programmers-wrong-a-case-for-interview-standardization"},"excerpt":"<p>I've conducted about 100 technical interviews over the past 6 months for a software development recruiting company called <a href=\"https://triplebyte.com/iv/RrzqKKw/bp\">Triplebyte</a>. I've also been doing consulting work, which has required me to take numerous technical interviews. It's interesting contrasting the experiences to identify what works and what doesn't.</p>\n<p>Every Triplebyte interview begins with the candidate coding a short game. We have a series of steps, and each step precisely defines simple requirements for the program to handle. I can generally tell a couple minutes into the 2 hour interview whether the candidate will be successful. There are certainly outliers (as well as mechanisms to prevent bias), but in general, I can quickly ascertain how well a candidate stacks up technically. So then, it begs the question, why is it so hard to hire engineers? The answer is, most of us are doing it wrong.</p>\n","fileAbsolutePath":"/Users/nickdrane/projects/blog/content/_posts/you're-hiring-programmers-wrong-a-case-for-interview-standardization.md","frontmatter":{"title":"You're Hiring Programmers Wrong: A Case for Interview Standardization","date":"2018-03-20T17:03:01.000Z"}}},{"node":{"fields":{"slug":"write-your-own-redux-connect"},"excerpt":"<p><em>My inspiration for this blog post came from <a href=\"https://www.youtube.com/watch?v=VJ38wSFbM3A\">this video</a> where Dan Abramov walks through the source code to react-redux</em></p>\n<p>As frontend web developers, it's not uncommon that we follow well-specified patterns - often blindly. The frontend landscape is changing rapidly, and sometimes there isn't time to investigate why we use a specific pattern; we just know we should.</p>\n<p>One widely used pattern in <a href=\"https://github.com/reactjs/react-redux\">react-redux</a> applications looks like this</p>\n<div class=\"gatsby-highlight\" data-language=\"js\"><pre class=\"language-js\"><code class=\"language-js\"><span class=\"token function\">connect</span><span class=\"token punctuation\">(</span>\n  mapStateToProps<span class=\"token punctuation\">,</span>\n  mapDispatchToProps\n<span class=\"token punctuation\">)</span><span class=\"token punctuation\">(</span>MyComponent<span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span></code></pre></div>\n<p>I'll assume you know how to implement this pattern, but why do we use it and how does it work under the hood?</p>\n","fileAbsolutePath":"/Users/nickdrane/projects/blog/content/_posts/write-your-own-redux-connect.md","frontmatter":{"title":"Write Your Own React-Redux Connect","date":"2017-09-29T13:14:18.000Z"}}},{"node":{"fields":{"slug":"hexo-vs-gatsbyjs-comparing-nodejs-static-site-generators"},"excerpt":"<p>There are two major <a href=\"https://davidwalsh.name/introduction-static-site-generators\">static site generators</a> in the Javascript ecosystem: the incumbent <a href=\"https://hexo.io\">Hexo</a> and the up-and-coming <a href=\"https://www.gatsbyjs.org/\">Gatsby</a>. This site was first built with Hexo, but I've recently switched to Gatsby. Let's talk about why.</p>\n","fileAbsolutePath":"/Users/nickdrane/projects/blog/content/_posts/hexo-vs-gatsbyjs-comparing-nodejs-static-site-generators/hexo-vs-gatsbyjs-comparing-nodejs-static-site-generators.md","frontmatter":{"title":"A Deep Dive into Javascript Static Site Generators: Gatsby vs. Hexo","date":"2018-11-24T00:00:00.000Z"}}},{"node":{"fields":{"slug":"ethical-engineering-for-the-average-engineer"},"excerpt":"<p>Two months ago I purchased a GPS device and associated service plan from <a href=\"https://www.findmespot.com/en/\">SPOT</a>. Today, upon trying to cancel the service, the customer service representative informed me that I had accidentally enrolled myself into a 1 year, $250 contract and that I was unable to cancel. He told me that if I blocked the monthly charges against my credit card that they would report the debt to a collections agency. I was initially upset but soon realized it was a great opportunity to talk about ethics in software engineering.</p>\n","fileAbsolutePath":"/Users/nickdrane/projects/blog/content/_posts/ethical-engineering-for-the-average-engineer/ethical-engineering-for-the-average-engineer.md","frontmatter":{"title":"Ethical Engineering for the Average Engineer","date":"2018-09-16T15:41:16.000Z"}}},{"node":{"fields":{"slug":"index"},"excerpt":"<p>At Fraight, we have an <a href=\"https://www.elastic.co/\">Elasticsearch</a> backed search interface that allows users to type a freetext query and get a list of our partners sorted by relevancy. At it's core, this is a simple problem: if the user types in <code class=\"language-text\">Joe</code>, return all partners whose name contains the word <code class=\"language-text\">Joe</code>. And indeed, returning all the <code class=\"language-text\">Joe</code>s in the system is straightforward; the problem is that we work with hundreds of <code class=\"language-text\">Joe</code>s. We needed a way to sort to the top the particular <code class=\"language-text\">Joe</code> that the user cares about.</p>\n","fileAbsolutePath":"/Users/nickdrane/projects/blog/content/_posts/optimizing-elasticsearch-score-how-to-rank-similar-documents/index.md","frontmatter":{"title":"Optimizing Elasticsearch Score: How to Rank Similar Documents","date":"2018-12-17T00:00:00.000Z"}}}]}},"pageContext":{}}