{"data":{"markdownRemark":{"html":"<p>There are two major <a href=\"https://davidwalsh.name/introduction-static-site-generators\">static site generators</a> in the Javascript ecosystem: the incumbent <a href=\"https://hexo.io\">Hexo</a> and the up-and-coming <a href=\"https://www.gatsbyjs.org/\">Gatsby</a>. This site was originally built with Hexo, but I've recently switched to Gatsby. Let's talk about why.</p>\n<!-- more -->\n<h2>Different Products</h2>\n<p>First, let's talk high level. Hexo and Gatsby are both static site generators, but at their hearts, they are very different products. Hexo is a blog generator; Gatsby sophisticated static content creation platform.</p>\n<h3>Hexo</h3>\n<p>Hexo specializes in creating markup (be it <a href=\"https://en.wikipedia.org/wiki/Markdown\">markdown</a> or <a href=\"https://en.wikipedia.org/wiki/ReStructuredText\">reStructuredText</a>) driven blogs. This specialization comes with tradeoffs. It's very easy to get a blog up and running, but if you want to do anything more sophisticated, it ranges from challenging to impossible. This is fine for most people's use cases, however.</p>\n<h3>Gatsby</h3>\n<p>Gatsby epitomizes customizability and allows for the creation of arbitrarily complex static sites, ranging from simple blogs to fully featured e-commerce websites. It provides <a href=\"https://www.gatsbyjs.org/docs/node-apis/\">an API</a> for you to build and query a GraphQL API composed of data from a variety of sources. You can then dynamically compose your static website based on the results of your queries. Gatsby trades power and flexibility for complexity, requiring users to learn some new tools to leverage it's capabilities. Let's get into the nitty gritty details.</p>\n<h2>Getting Up and Running</h2>\n<p>Both platforms are fairly easy to get from <code class=\"language-text\">yarn install</code> to writing blog articles, though Hexo definitely excels in this regard.</p>\n<h3>Hexo</h3>\n<p>With Hexo, I was able to install the application, run a couple <a href=\"https://hexo.io/docs/setup\">configuration commands</a>, pick a <a href=\"https://hexo.io/themes/index.html\">theme from their website</a>, and get writing.</p>\n<h3>Gatsby</h3>\n<p>Gatsby's sheer volume of documentation made the setup process slightly more challenging, though hardly difficult. There are two places you can start: their <a href=\"https://www.gatsbyjs.org/docs/\">getting started page</a> or <a href=\"https://www.gatsbyjs.org/tutorial/\">their tutorial</a>. The former will link you to their <a href=\"https://www.gatsbyjs.org/starters/?v=2\">starter library</a> and will help you get a server up and running. The latter will teach you how to customize your website.</p>\n<h2>Developer Experience</h2>\n<p>Hexo does not provide any tooling out-of-the-box, and your experience is largely determined by your theme. Gatsby, in contrast, gives the developer as many tools as possible to optimize their productivity.</p>\n<h3>Hexo</h3>\n<p>When I began with Hexo, I picked a theme called <a href=\"https://github.com/hmybmny/hexo-theme-concise\">Concise</a>, and my experience mostly stems from customizing this theme. Hexo originally only supported a dated templating language called <a href=\"https://ejs.co/\">EJS</a>, and my theme (and many others) happens to be written in it as well. Here is some sample code from the theme I used.</p>\n<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/f97f98761f9e68564060ccfd117dae13/e5894/concise-code.png\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 680px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 30.626780626780626%; position: relative; bottom: 0; left: 0; background-image: url('data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAAGCAYAAADDl76dAAAACXBIWXMAAAsSAAALEgHS3X78AAAA6klEQVQY052QwVLEIBBE9/+/Uje7iQkJLIQAgSXPIepBq/RgV/UUHKZ59CXEiNcaM89cu477/YZSM/sa0NqRlgWeT4q4iqmV33QcB5c2inP0146X1zvdtWfoNf3NYIY34jhi+kEeuzHKPT0sDWLfd/ZcCSlTcz7Dmi5tPEPAqwUzeZxJPB4bs7HilS1EIdU4azHG4FbPpBROgu1WmBZHWd33wOI3YkrU6Bs4/9XHl9shBqLPQlHEEaUtw6RRixWijSyVHNJdW/jLJ2EVsm1e8MOEHTWr0nghXn2UrhI5l7Mj2tInxRfNz7Cmd/s30vXaFhfWAAAAAElFTkSuQmCC'); background-size: cover; display: block;\"\n    >\n      <picture>\n        <source\n          srcset=\"/static/f97f98761f9e68564060ccfd117dae13/4ca7d/concise-code.webp 170w,\n/static/f97f98761f9e68564060ccfd117dae13/515c8/concise-code.webp 340w,\n/static/f97f98761f9e68564060ccfd117dae13/d6460/concise-code.webp 680w,\n/static/f97f98761f9e68564060ccfd117dae13/0b31f/concise-code.webp 702w\"\n          sizes=\"(max-width: 680px) 100vw, 680px\"\n          type=\"image/webp\"\n        />\n        <source\n          srcset=\"/static/f97f98761f9e68564060ccfd117dae13/f4d37/concise-code.png 170w,\n/static/f97f98761f9e68564060ccfd117dae13/dee79/concise-code.png 340w,\n/static/f97f98761f9e68564060ccfd117dae13/7ef4c/concise-code.png 680w,\n/static/f97f98761f9e68564060ccfd117dae13/e5894/concise-code.png 702w\"\n          sizes=\"(max-width: 680px) 100vw, 680px\"\n          type=\"image/png\"\n        />\n        <img\n          class=\"gatsby-resp-image-image\"\n          style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n          src=\"/static/f97f98761f9e68564060ccfd117dae13/7ef4c/concise-code.png\"\n          alt=\"Code sample from Concise\"\n          title=\"\"\n          src=\"/static/f97f98761f9e68564060ccfd117dae13/7ef4c/concise-code.png\"\n        />\n      </picture>\n      </span>\n  </span>\n  \n  </a>\n    </p>\n<p>Apart from the obvious readability problems, the syntax is challenging to edit and thus is at odds with application discoverability. It makes trivial exercises like console logging error-prone. Furthermore, the syntax is completely incompatible to the modern formatting tool, <a href=\"https://prettier.io/\">prettier</a>.</p>\n<p>Today, Hexo supports other templating languages, but it's a shame the library's community is so coupled to its previous decision.</p>\n<h3>Gatsby</h3>\n<p>Gatsby shines as far as developer tooling goes. All Gatsby applications are built using <a href=\"https://reactjs.org/\">React</a> and <a href=\"https://graphql.org/\">GraphQL</a>. Both are a pleasure to work with and were immediate productivity boosters for me. They do, however, have a non-trivial learning curve. Fortunately, the Gatsby docs assume no prior knowledge, and realistically, you only need minimal understanding to be productive.</p>\n<p>The aforementioned <a href=\"https://www.gatsbyjs.org/docs/node-apis/\">Gatsby API</a> also requires study to understand. It's powerful but lacks detailed documentation. Use cases for the various methods and hooks are scattered throughout the docs. I was able to supplement the documentation with blogs/tutorials such that learning the API was manageable.</p>\n<p>Gatsby also automatically configures numerous developer tools to optimize your productivity. For example, <a href=\"https://github.com/graphql/graphiql\">GraphiQL</a> (more on this later) allows you to explore your data sources, prettier ensures that your code remains consistently formatted, hot-reloading updates your UI without refreshing, and <a href=\"https://eslint.org/\">ESlint</a> catches your mistakes.</p>\n<p>Behind the scenes, Gatsby also configures webpack for you, abstracting away the most challenging parts of the React ecosystem. It goes to extra mile and things like service workers, inlining critical CSS, and CSS modules are automatic or a plugin away. Here is an exhaustive list of its <a href=\"https://www.gatsbyjs.org/features/\">features</a>.</p>\n<h2>Documentation</h2>\n<p>Hexo and Gatsby approach documentation very differently.</p>\n<h3>Hexo</h3>\n<p>Hexo does a great job of ensuring you need to read as little text as possible in order to get a blog up and running. If you want to customize your blog, however, the documentation's previously appreciated brevity shows it's warts. I would often read a page and have no idea what I was looking at, even when it was exactly what I needed.</p>\n<p>For example, if you want to customize your theme, you will need to know what variables are injected into your template engine's rendering system. This <a href=\"https://hexo.io/docs/variables.html\">site</a> provides the details but doesn't provide an overview explaining its purpose.</p>\n<p>I should provide one qualifying statement. Hexo augments its documentation with video tutorials. I never noticed them until I chose to write this article, but perhaps they provide the detail I previously yearned for.</p>\n<h3>Gatsby</h3>\n<p>Gatsby's documentation is thoughtful, well-organized, and remarkably detailed. It has everything from <a href=\"https://www.gatsbyjs.org/tutorial/\">tutorials</a> to deep dives <a href=\"https://www.gatsbyjs.org/docs/adding-images-fonts-files/\">1</a>, <a href=\"https://www.gatsbyjs.org/docs/creating-and-modifying-pages/\">2</a>, <a href=\"https://www.gatsbyjs.org/docs/styling/\">3</a>. The last link is a collection of deep dives all about styling! It even has pages explaining and justifying <a href=\"https://www.gatsbyjs.org/docs/behind-the-scenes/\">architecture and implementation details</a>. And to top all this off, it has a <a href=\"https://www.gatsbyjs.org/docs/gatsby-style-guide/\">style guide</a> to ensure readability.</p>\n<p>With all this said, there are still <a href=\"https://www.gatsbyjs.org/docs/dropping-images-into-static-folders/\">placeholder pages</a>, though I never found myself unable to answer a question about their system.</p>\n<h2>API Discoverability</h2>\n<p>A static site generator needs to make it easy to edit your website. One of the first requirements to editing your site is understanding the data structures the static site generator makes available to you.</p>\n<h3>Hexo</h3>\n<p>Hexo's data structures are documented in the [link mentioned above]((<a href=\"https://hexo.io/docs/variables.html\">https://hexo.io/docs/variables.html</a>). Inside, many key topics are referenced but never expounded upon. I remember agonizing over providing support for both pagination and article excerpts.</p>\n<p>The variables link above seems to hint that the next and previous blog posts are available from their API, though the fields were always <code class=\"language-text\">undefined</code>. I never figured out why.</p>\n<p>The same page also suggests excerpts are available. It wasn't until I discovered this <a href=\"https://github.com/hexojs/hexo/issues/1143\">GitHub issue</a> that I learned it's required to add the comment <code class=\"language-text\">&lt;!-- more --&gt;</code> to each post to ensure that this excerpt is populated. This feature is otherwise undocumented.</p>\n<p>These documentation problems were exacerbated by EJS, which doesn't provide an environment conducive to rapid code changes for environment exploration.</p>\n<h3>Gatsby</h3>\n<p>Gatsby exquisitely solves the problem of discoverability with <a href=\"https://github.com/graphql/graphiql\">GraphiQL</a>. It automatically spins up a GraphiQL server which allows you to interactively browse your data. Here is a simple example that queryies article excerpts and titles:</p>\n<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/88d7a264299e94fd26d656e6c241040e/255fa/graphiql.png\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 680px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 72.89256198347107%; position: relative; bottom: 0; left: 0; background-image: url('data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAAPCAYAAADkmO9VAAAACXBIWXMAABYlAAAWJQFJUiTwAAAB+0lEQVQ4y41T6XLyMBDjjYAkju8zB5Qe833v/zCq7EALnenxQ8PGeDWSdr2b5wUpZ5RSGjLrEAJSjPA+tDqyrkgptm9rDLxV8E7BaIV5nlg7jOOIXXIS3kiIocfxeGwQw4BQIuYloUTHywaajTdIqXmvw+Gw3d/v96wPrd4Vr3CZPEYxtEv1cCChoYpzCQ3OaCgSKSWv0FQj0Pc9uq57wK4eOj3yT5J1n4R2jrBrRHku8JcC90pbbzO0N7BVqfHtXnftuWFXD27SuztCNwWYOeBEovXfAveU4c4JOjmYqlJbCDF+9HwovP+4JzTBwhKOBJbQtK2vlp1RsDYwS7U5+wuhVgrBGmRvW62aTf5WMi0htUcvzN8VujXBM7+ZliPhqu2XAkXVSzJ4Yhw+nRvp8Xj4ndByuobTP71MWF7nlmEdUlVYVymGxElzfbr+cSjfEtYM2WiiZZ7bHiq5ZTgFx2wzhBaQgmd2hFCMoB9+yJBDCMyvqtGWA3G6DUoxv6WsKKcLpJshRv+wj79muDC7/J/5PW+7qLNrCk9T5k56SCMw0Hp3tf494bRluDK7iftn+V2nLOWIU+b5tEL5qrBHP4hHwq+oFlqGVKL5jtuzo9Vbjpm5Kpt5lySHz75mWQiBr5CyNmtEkrUM21u+EnIolk9VSksCPr07h5X0Hc578FYsVRseAAAAAElFTkSuQmCC'); background-size: cover; display: block;\"\n    >\n      <picture>\n        <source\n          srcset=\"/static/88d7a264299e94fd26d656e6c241040e/4ca7d/graphiql.webp 170w,\n/static/88d7a264299e94fd26d656e6c241040e/515c8/graphiql.webp 340w,\n/static/88d7a264299e94fd26d656e6c241040e/d6460/graphiql.webp 680w,\n/static/88d7a264299e94fd26d656e6c241040e/c4056/graphiql.webp 1020w,\n/static/88d7a264299e94fd26d656e6c241040e/862d7/graphiql.webp 1360w,\n/static/88d7a264299e94fd26d656e6c241040e/81026/graphiql.webp 2040w,\n/static/88d7a264299e94fd26d656e6c241040e/0fde8/graphiql.webp 2420w\"\n          sizes=\"(max-width: 680px) 100vw, 680px\"\n          type=\"image/webp\"\n        />\n        <source\n          srcset=\"/static/88d7a264299e94fd26d656e6c241040e/f4d37/graphiql.png 170w,\n/static/88d7a264299e94fd26d656e6c241040e/dee79/graphiql.png 340w,\n/static/88d7a264299e94fd26d656e6c241040e/7ef4c/graphiql.png 680w,\n/static/88d7a264299e94fd26d656e6c241040e/7236f/graphiql.png 1020w,\n/static/88d7a264299e94fd26d656e6c241040e/1cc92/graphiql.png 1360w,\n/static/88d7a264299e94fd26d656e6c241040e/1bb63/graphiql.png 2040w,\n/static/88d7a264299e94fd26d656e6c241040e/255fa/graphiql.png 2420w\"\n          sizes=\"(max-width: 680px) 100vw, 680px\"\n          type=\"image/png\"\n        />\n        <img\n          class=\"gatsby-resp-image-image\"\n          style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n          src=\"/static/88d7a264299e94fd26d656e6c241040e/7ef4c/graphiql.png\"\n          alt=\"GraphiQL Example\"\n          title=\"\"\n          src=\"/static/88d7a264299e94fd26d656e6c241040e/7ef4c/graphiql.png\"\n        />\n      </picture>\n      </span>\n  </span>\n  \n  </a>\n    </p>\n<p>You can see the query on the left, the results in the middle, and interactive schema documentation on the right. To top it all off, the environment provides autocomplete and errors messages.</p>\n<p>The contrast with Hexo's variable page is stark.</p>\n<h2>Community</h2>\n<p>How active is the community? How easy it to solve issues using tutorials and stack overflow?</p>\n<h3>Hexo</h3>\n<p>Hexo is probably still the most popular static site generator in the JS ecosystem, though I did not feel like the this made solving problems easier. I never felt I could find tutorials that discussed anything beyond the trivial.</p>\n<p>There's one other important note. Hexo's large community and user base comes with a caveat: it's largely Chinese. Unless your bilingual, this makes much of the documentation and many conversations unreadable.</p>\n<h3>Gatsby</h3>\n<p>I've been blown away by the quality of Gatsby's community so far. There are numerous tutorials online detailing how to solve various problems. Furthermore, the development community is vibrant and energetic.</p>\n<p>I ran into an issue where excerpts only rendered in plain text, not HTML. I opened a <a href=\"https://github.com/gatsbyjs/gatsby/pull/9716\">PR</a> to solve this problem and have been impressed with the responsiveness and thoughtfulness of the replies of the maintainers.</p>\n<h2>Plugin Ecosystem</h2>\n<h3>Hexo</h3>\n<p>Hexo has a <a href=\"https://hexo.io/plugins/index.html\">plugin page</a> detailing links to everything from markdown parsers to image and css optimizers. There are 277 plugins available, and I never ran into a situation where I couldn't find a plugin to do what I needed.</p>\n<h3>Gatsby</h3>\n<p>Gatsby has a similar <a href=\"https://hexo.io/plugins/index.html\">plugin search system</a> with seemingly everything you could want. Gatsby has twice as many plugins - 550 to be exact - available to date, though it's not clear to me how much additional value this offers over Hexo. I suspect there are plugins for more specific use cases that Hexo might lack; but I also know there are quite a few plugins that solve the same problem.</p>\n<p>On a side note, I appreciated that Gatsby sorts their plugin search results based on number downloads. This primitive but effective metric makes it much easier to evaluate the quality of a given plugin.</p>\n<h2>Misc</h2>\n<p>One thing I didn't know before I nearly completed my Gatsby blog is that even after building the project, it is not completely javascript free! This isn't to say the site is not fast; it excels in every performance test I've looked at so far. But your site will nevertheless not run on the machines of users who do not have javascript enabled.</p>\n<h2>Conclusion</h2>\n<p>Hexo are Gatsby are different products. If you're interested in picking a theme, spinning up a blog, and barely touching it, Hexo might be a simpler choice. If, however, you want flexibility and a productive developer experience, Gatsby overshadows Hexo in nearly every way.</p>","slug":"hexo-vs-gatsbyjs-comparing-nodejs-static-site-generators","frontmatter":{"title":"How to Choose a Javascript Static Site Generators: Gatsby vs. Hexo","date":"2018-11-18T00:00:00.000Z"}}},"pageContext":{"slug":"hexo-vs-gatsbyjs-comparing-nodejs-static-site-generators"}}