{"data":{"markdownRemark":{"html":"<p>If you've made your way here, I assume your looking to build yourself a blog or a static website. I also assume that you're a developer and want the flexibility to customize your site, otherwise you might want to consider an out-of-the-box solution like <a href=\"https://medium.com/\">Medium</a> or, for more customizability, <a href=\"https://wordpress.com/\">Wordpress</a></p>\n<p>There are two major static site generators in the Javascript ecosystem: the incumbent <a href=\"https://hexo.io\">Hexo</a> and the up-and-coming <a href=\"https://www.gatsbyjs.org/\">GatsbyJS</a>. In case you're just here for a TL;DR, GatsbyJS is the far better option. This site was originally built with Hexo, but I've recently felt compelled to switch. Let's talk about why.</p>\n<!-- more -->\n<h2>Different Products</h2>\n<p>First and foremost, I want to elaborate on what Hexo and Gatsby are designed to do. Both are static site generators, but at their hearts, they are very different products: Hexo is a blog generator; Gatsby sophisticated static content creation platform.</p>\n<h3>Hexo</h3>\n<p>Hexo specializes in creating markdown driven blogs. This specialization comes with tradeoffs. It's very easy to get a blog up and running, but if you want to do anything more sophisticated, it ranges from challenging to impossible. This is fine for most people's use cases, however.</p>\n<h3>Gatsby</h3>\n<p>Gatsby epitomizes customizability and allows for the creation of arbitrary static sites, ranging from simple blogs to fully featured e-commerce websites. It provides <a href=\"https://www.gatsbyjs.org/docs/node-apis/\">an API</a> for you to build and query a custom GraphQL API composed of data from a variety of sources. You can then dynamically compose your static website based on the results of your queries. Gatsby trades power and flexibility for complexity, requiring it users to learn some new tools to leverage it's capabilities. Let's get into the nitty gritty details.</p>\n<h2>Getting Up and Running</h2>\n<p>Both platforms are fairly easy to get from <code class=\"language-text\">yarn install</code> to writing blog articles, though Hexo definitely excels in thus regard.</p>\n<h3>Hexo</h3>\n<p>With Hexo, I was able to install the application, run a couple <a href=\"https://hexo.io/docs/setup\">configuration commands</a>, pick a <a href=\"https://hexo.io/themes/index.html\">theme from their website</a>, and get writing.</p>\n<h3>Gatsby</h3>\n<p>Gatsby was not exactly hard to setup, but the sheer volume of documentation on their website made the process a tad more challenging. There are two places you can start: their <a href=\"https://www.gatsbyjs.org/docs/\">getting started page</a> or <a href=\"https://www.gatsbyjs.org/tutorial/\">their tutorial</a>. The former will help you get a server up and running and will link you to the <a href=\"https://www.gatsbyjs.org/starters/?v=2\">starter library</a> where you can choose from many potential themes. The latter will teach you how to customize your website.</p>\n<h2>Developer Tooling</h2>\n<p>Hexo does not provide any tooling out-of-the-box, and your experience is largely determined by your theme. Gatsby, in contrast, tries to give the developer as many tools as possible to optimize their productivity.</p>\n<h3>Hexo</h3>\n<p>When I began with Hexo, I picked a theme called Concise, and my experience mostly stems from customizing this theme, though in my journey, I delved quite deeply into Hexo source code (which should be telling) and into the plugin ecosystem.</p>\n<p>My theme happened to be written using a dated templating language called <a href=\"https://ejs.co/\">EJS</a>. In it's effort to support all of Javascript's features, EJS excels at making code challenging to read and edit. Here is some sample code from the theme I used.</p>\n<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/f97f98761f9e68564060ccfd117dae13/e5894/concise-code.png\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 680px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 30.626780626780626%; position: relative; bottom: 0; left: 0; background-image: url('data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAAGCAYAAADDl76dAAAACXBIWXMAAAsSAAALEgHS3X78AAAA6klEQVQY052QwVLEIBBE9/+/Uje7iQkJLIQAgSXPIepBq/RgV/UUHKZ59CXEiNcaM89cu477/YZSM/sa0NqRlgWeT4q4iqmV33QcB5c2inP0146X1zvdtWfoNf3NYIY34jhi+kEeuzHKPT0sDWLfd/ZcCSlTcz7Dmi5tPEPAqwUzeZxJPB4bs7HilS1EIdU4azHG4FbPpBROgu1WmBZHWd33wOI3YkrU6Bs4/9XHl9shBqLPQlHEEaUtw6RRixWijSyVHNJdW/jLJ2EVsm1e8MOEHTWr0nghXn2UrhI5l7Mj2tInxRfNz7Cmd/s30vXaFhfWAAAAAElFTkSuQmCC'); background-size: cover; display: block;\"\n    >\n      <picture>\n        <source\n          srcset=\"/static/f97f98761f9e68564060ccfd117dae13/4ca7d/concise-code.webp 170w,\n/static/f97f98761f9e68564060ccfd117dae13/515c8/concise-code.webp 340w,\n/static/f97f98761f9e68564060ccfd117dae13/d6460/concise-code.webp 680w,\n/static/f97f98761f9e68564060ccfd117dae13/0b31f/concise-code.webp 702w\"\n          sizes=\"(max-width: 680px) 100vw, 680px\"\n          type=\"image/webp\"\n        />\n        <source\n          srcset=\"/static/f97f98761f9e68564060ccfd117dae13/f4d37/concise-code.png 170w,\n/static/f97f98761f9e68564060ccfd117dae13/dee79/concise-code.png 340w,\n/static/f97f98761f9e68564060ccfd117dae13/7ef4c/concise-code.png 680w,\n/static/f97f98761f9e68564060ccfd117dae13/e5894/concise-code.png 702w\"\n          sizes=\"(max-width: 680px) 100vw, 680px\"\n          type=\"image/png\"\n        />\n        <img\n          class=\"gatsby-resp-image-image\"\n          style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n          src=\"/static/f97f98761f9e68564060ccfd117dae13/7ef4c/concise-code.png\"\n          alt=\"Code sample from Concise\"\n          title=\"\"\n          src=\"/static/f97f98761f9e68564060ccfd117dae13/7ef4c/concise-code.png\"\n        />\n      </picture>\n      </span>\n  </span>\n  \n  </a>\n    </p>\n<p>Apart from the obvious readability problems, the syntax is at odds with application discoverability. It makes trivial exercises like console logging error-prone. Furthermore, the syntax is completely incompatible to the modern formatting tool, <a href=\"https://prettier.io/\">prettier</a>.</p>\n<p>Hexo does allow for other templating languages, but it's a shame that a developer's experience is so tightly coupled to the theme they pick.</p>\n<h3>Gatsby</h3>\n<p>Gatsby shines as far as developer tooling goes. All Gatsby applications are built using <a href=\"https://reactjs.org/\">React</a> and <a href=\"https://graphql.org/\">GraphQL</a>. Both are a pleasure to work with and were immediate productivity boosters for me. They do, however, have a non-trivial learning curve. Fortunately, the Gatsby docs do a decent job assuming you know nothing about how they work. And realistically, you only need minimal understanding to be productive, since ultimately most of your code will be Javascript.</p>\n<p>There is also a non-trivial investment required in understanding the aforementioned <a href=\"https://www.gatsbyjs.org/docs/node-apis/\">Gatsby API</a>. It's incredibly powerful but also not immediately obvious how to use. I was able to supplement the documentation with blogs/tutorials such that the learning requirements were manageable.</p>\n<p>Gatsby also comes with numerous developer tools preconfigured to optimize your productivity. For example, <a href=\"https://github.com/graphql/graphiql\">GraphiQL</a> (more on this later) allows you to explore the various data sources, prettier ensures that your code remains consistently formatted, code is hot reloaded, and <a href=\"https://eslint.org/\">ESlint</a> is to catches your mistakes.</p>\n<p>Behind the scenes, Gatsby configures webpack for you, ensuring that some of the most challenging parts of the React ecosystem are abstracted away. It goes to extra mile and make things like service workers, inlining critical CSS, and CSS modules are automatic or a plugin away. Here is a more extensive list of its <a href=\"https://www.gatsbyjs.org/features/\">features</a>.</p>\n<h2>DocumentationQuality and Quantity</h2>\n<p>Hexo does a great job of ensuring you need to read as little text as possible in order to get a blog up and running. Once you want to start customizing your blog, however, the documentation's previously appreciated brevity shows it's warts. It's not uncommon to be looking at the right thing and not know what you're looking at. If you want to customize your theme, chances are this page will be your best friend (<a href=\"https://hexo.io/docs/variables.html\">https://hexo.io/docs/variables.html</a>). Unfortunately, the page makes absolutely no indication as to its purpose. For the record, it documents the variable names that are injected into your template engine's rendering system.</p>\n<p>Gatsby's documentation is thoughtful, well-organized, and remarkably detailed. It has everything from <a href=\"https://www.gatsbyjs.org/tutorial/\">tutorials</a> to deep dives <a href=\"https://www.gatsbyjs.org/docs/adding-images-fonts-files/\">1</a><a href=\"https://www.gatsbyjs.org/docs/creating-and-modifying-pages/\">2</a><a href=\"https://www.gatsbyjs.org/docs/styling/\">3</a>. The last link is a collection of deep dives all about styling! It even has pages explaining and justifying <a href=\"https://www.gatsbyjs.org/docs/behind-the-scenes/\">architecture and implementation details</a>. And to top all this off, it has a <a href=\"https://www.gatsbyjs.org/docs/gatsby-style-guide/\">style guide</a> to ensure readability. With all this said, there are still placeholder pages (<a href=\"https://www.gatsbyjs.org/docs/dropping-images-into-static-folders/\">like this one</a>), though I never found myself unable to answer a question about their system.</p>\n<h3>API Discoverability</h3>\n<p>Hexo's variables are documented in the link mentioned above. Inside, many key topics are ambiguously referenced but never expounded upon. I remember agonizing over providing support for both pagination and article excerpts. The variables link above seems to hint that the next and previous blog posts are available from their API, though the fields were always <code class=\"language-text\">undefined</code>. I never figured out why. The same page also suggests excerpts are available. It wasn't until I discovered this GitHub issue that I learned it's required to add the comment <code class=\"language-text\">&lt;!-- more --&gt;</code> to each post to ensure that this excerpt is populated. There is no sensible default like grabbing the first 150 characters.</p>\n<p>Gatsby equisitely solves the problem of discoverability with <a href=\"https://github.com/graphql/graphiql\">GraphiQL</a>. It automatically spins up a GraphiQL server which allows you to interactively browse the GraphQL associated with your data. You can see what fields exist and how they are structured. You can even experiment with queries, and the environment provides feedback included autocomplete and errors messages. The contrast with Hexo's variable page is stark.</p>\n<h2>Gatsby</h2>\n<p>Gatsby absolutely crushes Hexo in this category.</p>\n<h2>Community</h2>\n<p>How easy it to solve issues using tutorials and stack overflow? Are small issues blocking or not? What is the plugin ecosystem like?</p>\n<h2>Plugin Ecosystem</h2>\n<h3>Available Plugins</h3>\n<p>Hexo has a <a href=\"https://hexo.io/plugins/index.html\">plugin page</a> detailing links to everything from markdown parsers to image and css optimizers. There are 277 plugins available, and I never ran into a situation where I couldn't find a plugin to do what I needed.</p>\n<p>Gatsby has a similar <a href=\"https://hexo.io/plugins/index.html\">plugin search system</a> with seemingly everything you could want. Gatsby has 550 plugins available to date, though it's not clear to me how much value this for most users over Hexo. I suspect there are plugins for more specific use cases that Hexo might lack; I also know there are quite a few plugins that solve the same problem.</p>\n<p>The one thing Gatsby does that really helps the developer identify solid plugins is that they sort their search results based on downloads. This is a primitive but effective metric for evaluating the quality of a given plugin.</p>\n<h3>Applying Plugins</h3>\n<p>Hexo has a fairly opaque system for applying plugins. It simply looks at the name of all installed packages, and if their name begins with (it might be includes) to string <code class=\"language-text\">hexo</code>, then they are treated as a plugin and evaluated specially.</p>\n<p>Every Gatsby project comes with a <code class=\"language-text\">gatsby-config.js</code> file where all used plugins documented and their associated arguments are applied. I felt like this system was far far superior to Hexo's implicit application of plugins.</p>\n<h2>Misc</h2>\n<p>One thing I didn't know before I nearly completed my Gatsby blog is that even after building, it is not completely javascript free! This isn't to say the site is not fast; it excels in every performance test I've looked at so far. But your site will nevertheless not run on the machines of users who do not have javascript enabled.</p>\n<h2>Conclusion</h2>\n<p>Hexo are Gatsby are different products. If you're interested in picking a theme, spinning up a blog, and barely touching it, Hexo might be a simpler choice. If, however, you want flexibility and productive developer experience, Gatsby overshadows Hexo in nearly ever way.</p>\n<p>Gatsby</p>\n<p>Simple things are far more complicated. Adding static pages is simple. Rendering them from markdown is quite a bit of work. Hexo is far more opinionated in this regard and makes such options simple.</p>","slug":"hexo-vs-gatsbyjs-comparing-nodejs-static-site-generators","frontmatter":{"title":"GatsbyJS Vs. Hexo Comparing Node.js Static Site Generators","date":"2018-11-18T00:00:00.000Z"}}},"pageContext":{"slug":"hexo-vs-gatsbyjs-comparing-nodejs-static-site-generators"}}