{"data":{"markdownRemark":{"html":"<p>My first introduction to functional programming was a couple years ago when I read through the famous <a href=\"https://mitpress.mit.edu/sicp/full-text/book/book.html\">SICP</a>. As someone who had up to this point worked with mostly in object oriented and imperative languages, I had rarely seen <code>map</code>, <code>fitler</code>, and <code>reduce</code> before that time. The purpose of the former two felt obvious; the latter one not so much. This blog post is geared for someone who knows how <code>reduce</code> works but feels like they struggle to use it practically.</p>\n<!-- more -->\n<h2>Reduce Basics</h2>\n<p><em>Feel free to skip this section if you understand the basics of reduce</em></p>\n<p><a href=\"https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/Reduce?v=a\">Reduce</a> is known as a higher order function (HOF). A HOF is defined as a function that either takes in or returns another function.</p>\n<p>Reduce takes two parameters: the first is a function, and the second is known as the initial accumulator. We will invoke this function over every element of an array. The ultimate goal is to transform the array into something new.</p>\n<p>Suppose we want to take an array of characters and concatenate them into a single string. In this example, the first argument we pass reduce is a HOF that will operate over every character. The HOF takes two arguments: the first is the accumulator and is the value that we ultimately want to assemble, and the second is a particular element of the array.</p>\n<p>Let's simulate what happens when we run a solution to the problem of concatenating strings.</p>\n<pre><code class=\"language-js\">const arrToConcat = ['a', 'b', 'c', 'd'];\narrToConcat.reduce(function(resultantString, nextCharacter) {\n  return resultantString + nextCharacter;\n}, \"\")  // initial accumulator. This is the second argument to reduce!\n</code></pre>\n<p>You can use the below table to help guide yourself along</p>\n<table>\n<thead>\n<tr>\n<th align=\"center\">invocation #</th>\n<th align=\"center\">resultantString</th>\n<th align=\"center\">nextCharacter</th>\n<th align=\"center\">return value</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td align=\"center\">1</td>\n<td align=\"center\">\"\"</td>\n<td align=\"center\">'a'</td>\n<td align=\"center\">'a'</td>\n</tr>\n<tr>\n<td align=\"center\">2</td>\n<td align=\"center\">\"a\"</td>\n<td align=\"center\">'b'</td>\n<td align=\"center\">'ab'</td>\n</tr>\n<tr>\n<td align=\"center\">3</td>\n<td align=\"center\">\"ab\"</td>\n<td align=\"center\">'c'</td>\n<td align=\"center\">'abc'</td>\n</tr>\n<tr>\n<td align=\"center\">4</td>\n<td align=\"center\">\"abc\"</td>\n<td align=\"center\">'d'</td>\n<td align=\"center\">'abcd'</td>\n</tr>\n</tbody>\n</table>\n<p>We will ultimately call our HOF 4 times, passing in each of the 4 elements in the initial array.</p>\n<p>The first time we invoke the HOF, the first argument is always the initial accumulator. Notice the <code>\"\"</code> passed into reduce above. The second argument is <code>'a'</code> because that's the first element in our array. We return 'a', and this return value is the <code>resultantString</code> that is passed as an argument to the second invocation of our HOF, along with the next element of the array, <code>'b'</code>. The process continues. <code>'ab'</code> is returned from the HOF's second invocation, and <code>'ab'</code> and <code>'c'</code> are passed into the third invocation of the HOF. Ultimately, <code>reduce</code> returns <code>'abcd'</code>.</p>\n<p>We built up the result step by step through a series of concatenation steps. Every call to the HOF will return a string with one additional character added to the previous accumulator.</p>\n<h2>Know Your Return Type</h2>\n<p>I think one of the reasons <code>map</code> and <code>filter</code> are easier than <code>reduce</code> is because they always return an array. That's not the case for <code>reduce</code>. <code>reduce</code> is ultimately designed to transform one type into another.</p>\n<p>When you begin writing a <code>reduce</code> statement, your first question to yourself should be \"What type am I returning?\". Here's a hint, it's probably one of the following: <code>String</code>, <code>Number</code>, <code>Object</code>, <code>Array</code>. Once you know what type you will return you can begin writing your reduce statement. I say this because the initial accumulator (reduce's second argument) can easily be determined by what type you expect <code>reduce</code> to return. Here is a table to guide your decision.</p>\n<table>\n<thead>\n<tr>\n<th align=\"center\">return type</th>\n<th align=\"center\">initial accumulator</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td align=\"center\">string</td>\n<td align=\"center\">\"\"</td>\n</tr>\n<tr>\n<td align=\"center\">number</td>\n<td align=\"center\">0</td>\n</tr>\n<tr>\n<td align=\"center\">object</td>\n<td align=\"center\">{}</td>\n</tr>\n<tr>\n<td align=\"center\">array</td>\n<td align=\"center\">[]</td>\n</tr>\n</tbody>\n</table>\n<p><strong>Notice that the initial accumulator and the return type are always the same!</strong></p>\n<p><em>You probably won't want return an array from a reduce function very often because chances are you could have more simply used a combination of <code>map</code>, <code>filter</code>, and/or some other function instead.</em></p>\n<h2>Summing Odd Numbers</h2>\n<p>So let's say we want to reduce over a set of numbers and return the sum of all the odd numbers. Since we are returning a <code>number</code>, we can use the above table to determine that the starting accumulator should be 0. That gives us a pretty decent starting point!</p>\n<pre><code class=\"language-js\">const arrToSum = [1, 2, 3, 4, 5];\narrToSum.reduce(function(currentSum, nextNumber) {\n\n}, 0)  // This is the second argument to reduce!\n</code></pre>\n<p>Now we just need to complete the guts of the function such that it increments the sum when the <code>nextNumber</code> is odd. If <code>nextNumber</code> is even, it should return <code>currentSum</code> unchanged.</p>\n<pre><code class=\"language-js\">const arrToSum = [1, 2, 3, 4, 5];\narrToSum.reduce(function(currentSum, nextNumber) {\n  // nextNumber is odd\n  if (nextNumber % 2 === 1) {\n    return currentSum + nextNumber\n  // nextNumber is even\n  } else {\n    return currentSum\n  }\n}, 0)\n</code></pre>\n<p>One interesting thing to note about the above code is that EVERY code path (every if-else block) returns something. This is a very common theme throughout the functional programming paradigm and holds true when writing reduce's higher order function. In general it's a decent litmus test to establish if you've made a bug somewhere. <strong>More specifically, if every code path does not return something, and if that something is not the same type as your accumulator, you probably have a bug.</strong></p>\n<h2>Frequency Counter</h2>\n<p>Let's do something a little different. Suppose I have an array of words, and I want to count how many times each word appears in the array. We can represent this information using an object that maps words in the array to a number indicating their frequency of occurrence.</p>\n<pre><code class=\"language-js\">// We will input something like this\n['luke', 'anakin', 'chewy', 'luke', 'chewy', 'princess', 'leia', 'chewy'] ->\n\n// And output something like this\n{\n  luke: 2,\n  anakin: 1,\n  princess: 1,\n  chewy: 3,\n  leia: 1\n}\n</code></pre>\n<p>Consulting the table above, we know that the starting accumulator needs to be an empty object. This means that each iteration over the array returns an object as well.</p>\n<pre><code class=\"language-js\">const frequencyArray = ['luke', 'anakin', 'chewy', 'luke', 'chewy', 'princess', 'leia', 'chewy'];\nfrequencyArray.reduce(function(resultantObject, nextWord) {\n\n}, {})\n</code></pre>\n<p>Every step of the higher order function needs to examine the next word and determine if it has been seen before. If it has not, then we need to add an entry to the accumulator and return it. If it has, then we need to increment the existing entry inside the accumulator object and return it.</p>\n<pre><code class=\"language-js\">frequencyArray.reduce(function(resultantObject, nextWord) {\n  // If the word is not in the object\n  if (!resultantObject.hasOwnProperty(nextWord)) {\n    resultantObject[nextWord] = 1 //Set it to 1 since we have seen the word before\n    return resultantObject\n  } else {\n    // Otherwise increment the counter for that word inside the resulting object\n    resultantObject[nextWord]++\n    return resultantObject\n  }\n}, {})\n</code></pre>\n<p>Just like the first example, every code path returns the type of the accumulator.</p>\n<h2>Merging Objects</h2>\n<p>Let's end with something a little more complicated.</p>\n<p>Suppose we want to implement a merge function to combines several objects into a single object. We're going to implement something really similar to <a href=\"https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object/assign\">Object.assign</a>. Here are some examples.</p>\n<pre><code class=\"language-js\">merge([ { a: 4, b: 3 }, { c:10 } ]) --> { a: 4, b: 3, c: 10 }\n\nmerge([ { a: 4, b: 3 }, { c:4 }, {f: 7} ]) --> { a: 4, b: 3, c: 4, f: 7}\n\n// Duplicate keys take the value of the latter object\nmerge([ { a: 4, b: 3 }, { c:4 }, {a: 7} ]) --> { a: 7, b: 3, c: 4}\n</code></pre>\n<p>We know that the return value from this operation is an object, so that will be our starting accumulator. Every iteration of the array will produce a new object that contains the merging of the previous accumulator and the next object.</p>\n<pre><code class=\"language-js\">// This merge function will take in two objects and output a new object\n// containing both the keys and values from the two input objects.\nfunction mergeTwo(obj1, obj2) {\n  const newObj = {}\n  for (let key in obj1) {\n    newObj[key] = obj1[key]\n  }\n  for (let key in obj2) {\n    newObj[key] = obj2[key]\n  }\n  return newObj\n}\n\nfunction merge(arr) {\n  return arr.reduce(function(resultantObj, nextObj) {\n    return mergeTwo(resultantObj, nextObj)\n  }, {})\n}\n</code></pre>\n<h2>Summary</h2>\n<p>To summarize</p>\n<ol>\n<li>Always start by asking what the type of your output is. The type of your accumulator will follow by using the mapping table.</li>\n<li>The logic inside your higher order function should assemble your resulting accumulator piecemeal. Since the return value of the previous iteration is the input to the next iteration, every code path must return a value</li>\n<li>Furthermore, unless you want a horrible experience, every code path MUST return a value whose type is the same as that of your initial accumulator.</li>\n</ol>\n<h2>Conclusion</h2>\n<p>At the end of the day, just about everything you can do with reduce can be done with some combination of <code>map</code> and <code>fitler</code> and perhaps another <a href=\"https://lodash.com/docs/4.17.4%5D\">functional method</a>. And the alternative solution is almost always simpler and more readable. So, in practice, you probably don't want to use <code>reduce</code> that often. With that said, <code>reduce</code> is a building block on which every other functional method can be built, and we will explore this unique trait in my next blog post.</p>","frontmatter":{"title":"Using Reduce","date":"2017-09-28T10:36:30.000Z"}}},"pageContext":{"slug":"using-reduce"}}