{"data":{"allMarkdownRemark":{"totalCount":12,"edges":[{"node":{"excerpt":"Two months ago I purchased a GPS device and associated service plan from  SPOT . Today, upon trying to cancel the service, the customer…","frontmatter":{"title":"Ethical Engineering for the Average Engineer","date":"2018-09-16T15:41:16.000Z"}}},{"node":{"excerpt":"I posted my article  Build Your Own Regex Engine  on Reddit the other day, and one of the commenters claimed that the implementation should…","frontmatter":{"title":"Regex And Automated Test Fuzzing","date":"2017-12-06T00:00:00.000Z"}}},{"node":{"excerpt":"I'm currently contracted to create a web service using some data from a third party Angular application. I worked off a proof of concept…","frontmatter":{"title":"Scraping the Web with Puppeteer: Lessons Learned","date":"2017-12-09T15:35:13.000Z"}}},{"node":{"excerpt":"React has taken the web development community by a storm, and with it functional programming concepts have embedded themselves in the…","frontmatter":{"title":"Leveraging Immutability in React","date":"2017-09-27T09:30:27.000Z"}}},{"node":{"excerpt":"A client approached me with a puzzling problem: At Fraight, we have an omnisearch interface backed by an Elasticsearch datastore. The…","frontmatter":{"title":"Optimizing Elasticsearch Score: How to Rank and Differentiate Similar Records","date":"2017-10-11T00:00:00.000Z"}}},{"node":{"excerpt":"I've conducted about 100 technical interviews over the past 6 months for a software development recruiting company called  Triplebyte . I've…","frontmatter":{"title":"You're Hiring Programmers Wrong: A Case for Interview Standardization","date":"2018-03-20T17:03:01.000Z"}}},{"node":{"excerpt":"The other day at work, one of my colleagues was frustrated that he was unable to encode nested objects in a query string and still maintain…","frontmatter":{"title":"Build Your Own Nested Query String Encoder/Decoder","date":"2018-04-13T15:17:00.000Z"}}},{"node":{"excerpt":"I stumbled upon an  article  the other day where Rob Pike implements a rudimentary regular expression engine in c. I converted his code to…","frontmatter":{"title":"Build a Regex Engine in Less than 40 Lines of Code","date":"2017-11-28T11:36:04.000Z"}}},{"node":{"excerpt":"Postgres  introduced the  JSONB  type in version 9.4 with considerable excitement. JSONB promised to marry a favorite relational database…","frontmatter":{"title":"The Hidden Costs of PostgreSQL's JSONB Datatype","date":"2018-09-30T00:00:00.000Z"}}},{"node":{"excerpt":"I recently wanted to ingest a  line-delimited  JSON file into  Postgres  for some quick data exploration. I was surprised when I couldn't…","frontmatter":{"title":"Using Shell Commands to Effortlessly Ingest Line-delimited JSON into PostgreSQL","date":"2018-10-18T00:00:00.000Z"}}},{"node":{"excerpt":"My inspiration for this blog post came from  this video  where Dan Abramov walks through the source code to react-redux As frontend web…","frontmatter":{"title":"Write Your Own React-Redux Connect","date":"2017-09-29T13:14:18.000Z"}}},{"node":{"excerpt":"My first introduction to functional programming was a couple years ago when I read through the famous  SICP . As someone who had up to this…","frontmatter":{"title":"Using Reduce","date":"2017-09-28T10:36:30.000Z"}}}]}},"pageContext":{}}